     A*--------------------------------------------------------------
     A*
     A*
     A          R PETIKF
     A*
     A            PKPARM       500A         COLHDG('SPOOL')
     A
