     ‚*--------------------------------------------------------------
     ‚* ZENTRALE OUTQ-ERMITTLUNG
     ‚*--------------------------------------------------------------
       COPY-GET-OUTQ SECTION.
       CPY-GOU-00C.

           MOVE     "PRT01" TO CPY-OUTQ.

       CPY-GOU-90C.
           EXIT.
      /
