     ‚*--------------------------------------------------------
     ‚* STANDARD-WORKFELDER FÜR PGM-AUFRUF-PARAMETER
     ‚*--------------------------------------------------------

     ‚* FELDER FÜR CLP0001 (RTVJOBA)
       01  RTVJOBA-TYPE IS TYPEDEF.
           05 JOB                        PIC X(10).
           05 USER                       PIC X(10).
           05 JOBNBR                     PIC X(6).
           05 LANGID                     PIC X(3).
           05 CCSID                      PIC X(5).

     ‚* FELDER FÜR CLP0002 (RTVMBRD)
       01  RTVMBRD-TYPE IS TYPEDEF.
           05 OBJLIB                     PIC X(10).
           05 FILENAME                   PIC X(10).
           05 MBRNAME                    PIC X(10).
           05 SRCTYPE                    PIC X(10).
           05 CRTDATE                    PIC X(13).
           05 CHGDATE                    PIC X(13).
           05 SAVDATE                    PIC X(13).
           05 RSTDATE                    PIC X(13).
           05 USEDATE                    PIC X(7).
           05 USECOUNT                   PIC 9(5).
           05 NBRCURRCD                  PIC 9(10).
           05 NBRDLTRCD                  PIC 9(10).
           05 MBRTEXT                    PIC X(50).

     ‚* FELDER FÜR CLP0003 (ADDMSGD)
       01  ADDMSG-TYPE IS TYPEDEF.
           05 MSGID                      PIC X(7).
           05 MSGF                       PIC X(10).
           05 MSGLIB                     PIC X(10).
           05 MSG                        PIC X(80).

     ‚* FELDER FÜR CLP0004 (CHKOBJ)
       01  CHKOBJ-TYPE IS TYPEDEF.
           05 LIB                        PIC X(10).
           05 OBJ                        PIC X(10).
           05 OBJTYPE                    PIC X(7).
           05 MBR                        PIC X(10).
           05 AUT                        PIC X(10).
           05 OBJ-EXIST                  PIC X(1).

     ‚* FELDER FÜR CLP0005 (CRTMSGF)
       01  CRTMSGF-TYPE IS TYPEDEF.
           05 MSGF                       PIC X(10).
           05 MSGLIB                     PIC X(10).
           05 MSGTXT                     PIC X(50).

     ‚* FELDER FÜR CLP0006 (RTVOBJD)
       01  RTVOBJD-TYPE IS TYPEDEF.
           05 OBJLIB                     PIC X(10).
           05 OBJ                        PIC X(10).
           05 OBJTYPE                    PIC X(7).
           05 RTNLIB                     PIC X(10).
           05 OBJATR                     PIC X(10).
           05 OBJTEXT                    PIC X(50).
           05 SRCF                       PIC X(10).
           05 SRCFLIB                    PIC X(10).
           05 SRCMBR                     PIC X(10).
           05 CRTUSER                    PIC X(10).
           05 CRTSYSTEM                  PIC X(8).
           05 USEDATE                    PIC X(7).
           05 USECOUNT                   PIC 9(5).

     ‚* FELDER FÜR CLP0007 (ADDLIBLE)
       01  ADDLIBLE-TYPE IS TYPEDEF.
           05 LIB                        PIC X(10).
           05 LIBPOS                     PIC X(8).
           05 REFLIB                     PIC X(10).

     ‚* FELDER FÜR CLP0009 (RMVLIBLE)
       01  RMVLIBLE-TYPE IS TYPEDEF.
           05 LIB                        PIC X(10).

     ‚* FELDER FÜR CLP0010 (SNDMSG)
       01  SNDMSG-TYPE IS TYPEDEF.
           05 MSGTXT                     PIC X(512).
           05 USER                       PIC X(10).

     ‚* FELDER FÜR CLP0011 (OVRDBF)
       01  OVRDBF-TYPE IS TYPEDEF.
           05 FROMFILE                   PIC X(10).
           05 TOLIB                      PIC X(10).
           05 TOFILE                     PIC X(10).
           05 TOMBR                      PIC X(10).
           05 LVLCHK                     PIC X(3).

     ‚* FELDER FÜR CLP0012 (DELOVR)
       01  DELOVR-TYPE IS TYPEDEF.
           05 FROMFILE                   PIC X(10).

     ‚* FELDER FÜR CLP0016 (SNDPGMMSG)
       01  SNDPGMMSG-TYPE IS TYPEDEF.
           05 MSG                        PIC X(512).
           05 MSGTYPE                    PIC X(7).
           05 MSGID                      PIC X(7).
           05 MSGF                       PIC X(10).
           05 MSGDTA                     PIC X(100).
           05 TOPGMQ                     PIC X(10).
           05 TOMSGQ                     PIC X(10).

     ‚* FELDER FÜR CLP0017 (SNDBRKMSG)
       01  SNDBRKMSG-TYPE IS TYPEDEF.
           05 MSG                        PIC X(512).
           05 TERM                       PIC X(10).

     ‚* FELDER FÜR CLP0018 (WRKUSRJOB)
       01  WRKUSRJOB-TYPE IS TYPEDEF.
           05 TUSER                      PIC X(10).
           05 JOBSTATUS                  PIC X(7).
           05 OUTOPT                     PIC X(6).
           05 JOBTYPE                    PIC X(9).

     ‚* FELDER FÜR CLP0019 (RFZPFM)
       01  RGZPFM-TYPE IS TYPEDEF.
           05 OBJLIB                     PIC X(10).
           05 FILENAME                   PIC X(10).
           05 MBRNAME                    PIC X(10).
           05 SRCOPT                     PIC X(7).

     ‚* FELDER FÜR CLP0020 (CRTCBLPGM)
       01  CRTCBLPGM-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 TGTRLS                     PIC X(10).
           05 USRPRF                     PIC X(10).
           05 OPTIONS                    PIC X(33).
           05 GENOPT                     PIC X(33).

     ‚* FELDER FÜR CLP0021 (CRTBNDCBL)
       01  CRTBNDCBL-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 ACTGRP                     PIC X(10).
           05 TGTRLS                     PIC X(10).
           05 USRPRF                     PIC X(10).
           05 OPTIMIZE                   PIC X(6).
           05 DEBUG                      PIC X(7).
           05 BNDDIR                     PIC X(10).

     ‚* FELDER FÜR CLP0023 (CRTBNDCL)
       01  CRTBNDCL-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 ACTGRP                     PIC X(10).
           05 TGTRLS                     PIC X(10).
           05 USRPRF                     PIC X(10).
           05 OPTIMIZE                   PIC X(6).
           05 DEBUG                      PIC X(7).
           05 BNDDIR                     PIC X(10).

     ‚* FELDER FÜR CLP0024 (CRTCMD)
       01  CRTCMD-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 EXCLIB                     PIC X(10).
           05 EXCPGM                     PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 OVRLIB                     PIC X(10).
           05 OVRPGM                     PIC X(10).
           05 PRDLIB                     PIC X(10).

     ‚* FELDER FÜR CLP0025 (CRTCMOD)
       01  CRTCMOD-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 TGTRLS                     PIC X(10).
           05 DEBUG                      PIC X(7).
           05 DEFINE                     PIC X(80).

     ‚* FELDER FÜR CLP0027 (CRTSQLCBLI)
       01  CRTSQLCBL-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 TGTRLS                     PIC X(10).
           05 BNDDIR                     PIC X(10).
           05 ACTGRP                     PIC X(10).
           05 DEBUG                      PIC X(7).

     ‚* FELDER FÜR CLP0028 (CRTPNLGRP)
       01  CRTPNLGRP-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).

     ‚* FELDER FÜR CLP0030 (CRTDSPF)
       01  CRTDSPF-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 RSTDSP                     PIC X(4).
           05 DFRWRT                     PIC X(4).

     ‚* FELDER FÜR CLP0031 (CRTPF)
       01  CRTPF-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 DLSIZE                     PIC X(10).
           05 DLMAXE                     PIC X(5).
           05 DLEXT                      PIC X(5).
           05 RECSIZE                    PIC X(6).

     ‚* FELDER FÜR CLP0032 (CRTLF)
       01  CRTLF-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).

     ‚* FELDER FÜR CLP0034 (CRTCBLMOD)
       01  CRTCBLMOD-TYPE IS TYPEDEF.
           05 TOLIB                      PIC X(10).
           05 TOPGM                      PIC X(10).
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 TGTRLS                     PIC X(10).
           05 OPTIMIZE                   PIC X(6).
           05 DEBUG                      PIC X(7).

     ‚* FELDER FÜR CLP0035 (CRTTBL)
       01  CRTTBL-TYPE IS TYPEDEF.
        05 TOLIB                         PIC X(10).
        05 TOPGM                         PIC X(10).
        05 FROMLIB                       PIC X(10).
        05 FROMFILE                      PIC X(10).
        05 FROMMBR                       PIC X(10).
        05 TBLTYPE                       PIC X(10).

     ‚* FELDER FÜR CLP0040 (SBMJOB)
       01  SBMJOB-TYPE IS TYPEDEF.
           05 PGMNAM                     PIC X(10).
           05 PARM                       PIC X(1024).
           05 JOBNAME                    PIC X(10).
           05 USRSBS                     PIC X(10).
           05 TUSER                      PIC X(10).
           05 JOBD                       PIC X(10).
           05 INQMSGR                    PIC X(10).
           05 SBMNAME                    PIC X(10).
           05 SBMUSER                    PIC X(10).
           05 SBMNUM                     PIC X(6).

     ‚* FELDER FÜR CLP0041 (OVRPRTF)
       01  OVRPRTF-TYPE IS TYPEDEF.
           05 FROMFILE                   PIC X(10).
           05 TOFILE                     PIC X(10).
           05 TOOUTQ                     PIC X(10).
           05 USRDTA                     PIC X(10).
           05 SPLFNAME                   PIC X(10).
           05 RPLCHAR                    PIC X(1).
           05 RPLNPRTCHR                 PIC X(4).

     ‚* FELDER FÜR CLP0042 (DSPFD)
       01  DSPFD-TYPE IS TYPEDEF.
           05 FILENAME                   PIC X(10).
           05 LIBNAME                    PIC X(10).
           05 TYPNAME                    PIC X(10).
           05 OUTPUTTYP                  PIC X(10).
           05 FILEATR                    PIC X(10).
           05 OUTFILE                    PIC X(10).
           05 OUTLIB                     PIC X(10).
           05 OUTMBR                     PIC X(10).
           05 OUTOPT                     PIC X(10).
           05 REMOTESYS                  PIC X(04).

     ‚* FELDER FÜR CLP0043 (DSPFFD)
       01  DSPFFD-TYPE IS TYPEDEF.
           05 FILENAME                   PIC X(10).
           05 LIBNAME                    PIC X(10).
           05 OUTFILE                    PIC X(10).
           05 OUTLIB                     PIC X(10).

     ‚* FELDER FÜR CLP0044 (DLTF)
       01  DLTF-TYPE IS TYPEDEF.
           05 FILENAME                   PIC X(10).
           05 LIBNAME                    PIC X(10).

     ‚* FELDER FÜR CLP0045 (GRTOBJAUT)
       01  GRTOBJAUT-TYPE IS TYPEDEF.
           05 FILENAME                   PIC X(10).
           05 LIBNAME                    PIC X(10).
           05 TYPNAME                    PIC X(7).
           05 TUSER                      PIC X(10).
           05 AUT                        PIC X(10).

     ‚* FELDER FÜR CLP0046 (CPYSPLF)
       01  CPYSPLF-TYPE IS TYPEDEF.
           05 SPOOLNAME                  PIC X(10).
           05 JOBNAME                    PIC X(10).
           05 TOLIB                      PIC X(10).
           05 TOFILE                     PIC X(10).
           05 MBROPT                     PIC X(8).

     ‚* FELDER FÜR CLP0047 (DSPPFM)
       01  DSPPFM-TYPE IS TYPEDEF.
           05 LIBNAME                    PIC X(10).
           05 FILENAME                   PIC X(10).
           05 MBRNAME                    PIC X(10).

     ‚* FELDER FÜR CLP0048 (RUNSQL)
       01  RUNSQL-TYPE IS TYPEDEF.
           05 SQLANF                     PIC X(1000).
           05 OUTTYP                     PIC X(10).

     ‚* FELDER FÜR CLP0049 (CHGPFM)
       01  CHGPFM-TYPE IS TYPEDEF.
           05 LIBNAME                    PIC X(10).
           05 FILENAME                   PIC X(10).
           05 MBRNAME                    PIC X(10).
           05 TYPNAME                    PIC X(10).
           05 SRCTXT                     PIC X(50).

     ‚* FELDER FÜR CLP0050 (WRKOBJLCK)
       01  WRKOBJLCK-TYPE IS TYPEDEF.
           05 LIBNAME                    PIC X(10).
           05 FILENAME                   PIC X(10).
           05 MBRNAME                    PIC X(10).
           05 TYPNAME                    PIC X(7).

     ‚* FELDER FÜR CLP0051 (ALCOBJ)
       01  ALCOBJ-TYPE IS TYPEDEF.
           05 LIBNAME                    PIC X(10).
           05 FILENAME                   PIC X(10).
           05 MBRNAME                    PIC X(10).
           05 TYPNAME                    PIC X(10).
           05 SPRSTS                     PIC X(7).
           05 TIMEWAIT                   PIC X(3).

     ‚* FELDER FÜR CLP0052 (DLCOBJ)
       01  DLCOBJ-TYPE IS TYPEDEF.
           05 LIBNAME                    PIC X(10).
           05 FILENAME                   PIC X(10).
           05 MBRNAME                    PIC X(10).
           05 TYPNAME                    PIC X(10).
           05 SPRSTS                     PIC X(7).

     ‚* FELDER FÜR CLP0053 (CPYF)
       01 CPYF-TYPE IS TYPEDEF.
           05 FROMLIB                    PIC X(10).
           05 FROMFILE                   PIC X(10).
           05 FROMMBR                    PIC X(10).
           05 TOLIB                      PIC X(10).
           05 TOFILE                     PIC X(10).
           05 TOMBR                      PIC X(10).
           05 SRCOPT                     PIC X(8).
           05 FMTOPT                     PIC X(10).
           05 CRTFIL                     PIC X(4).

     ‚* FELDER FÜR CLP0054 (CHGOBJOWN)
       01 CHGOBJOWN-TYPE IS TYPEDEF.
           05 LIBNAME                    PIC X(10).
           05 FILENAME                   PIC X(10).
           05 TYPNAME                    PIC X(7).
           05 NEWOWN                     PIC X(10).

     ‚* FELDER FÜR CLP0057 (QCMDEXC)
       01 CMDEXC-TYPE IS TYPEDEF.
           05 COMMAND                    PIC X(4000).
           05 XF3                        PIC X(1).
           05 XF12                       PIC X(1).

     ‚* FELDER FÜR CLP0058 (STRPCCMD)
       01 STRPCCMD-TYPE IS TYPEDEF.
           05 COMMAND                    PIC X(123).
           05 DATEI                      PIC X(123).
           05 DATEIART                   PIC X(3).

     ‚* FELDER FÜR CLP0060 (RTVNETA)
       01 RTVNETA-TYPE IS TYPEDEF.
           05 AKTION                     PIC X(10).
           05 SYSNAME                    PIC X(8).

     ‚* FELDER FÜR CLP0066 (RCLACTGRP)
       01 RCLACTG-TYPE IS TYPEDEF.
           05 ACTGRP                     PIC X(10).
           05 AKTION                     PIC X(9).

     ‚* FELDER FÜR CLP0067 (CRTDTAARA)
       01  CRTDTAARA-TYPE IS TYPEDEF.
           05  DTAARA                     PIC  X(10).
           05  DTALIB                     PIC  X(10).
           05  DTALEN                     PIC  X(4).
           05  DTATEXT                    PIC  X(50).
           05  DTAAUT                     PIC  X(10).

     ‚* FELDER FÜR CLP0068 (RTVDTAARA)
       01  RTVDTAARA-TYPE IS TYPEDEF.
           05  DTAARA                     PIC  X(10).
           05  DTALIB                     PIC  X(10).
           05  DTASPOS                    PIC  X(4).
           05  DTALEN                     PIC  X(4).
           05  RTNVAR                     PIC  X(2000).

     ‚* FELDER FÜR CLP0069 (CHGDTAARA)
       01  CHGDTAARA-TYPE IS TYPEDEF.
           05  DTAARA                     PIC  X(10).
           05  DTALIB                     PIC  X(10).
           05  STRPOS                     PIC  X(4).
           05  LENPOS                     PIC  X(4).
           05  DTAVAL                     PIC  X(2000).

     ‚* FELDER FÜR CLP0070 (CRTSRCPF)
       01 CRTSRCPF-TYPE IS TYPEDEF.
           05 LIBOBJ                     PIC X(10).
           05 OBJ                        PIC X(10).
           05 MBRNAME                    PIC X(10).
           05 RCDLEN                     PIC X(6).
           05 CCSID                      PIC X(11).
           05 SRCTXT                     PIC X(50).

     ‚* FELDER FÜR CLP0071 (WRKSRVTBLE)
       01 WRKSRVTBLE-TYPE IS TYPEDEF.
           05 SERVICENAME                PIC X(32).

     ‚* FELDER FÜR CLP0072 (DLTSPLF)
       01 DLTSPLF-TYPE IS TYPEDEF.
           05 FILENAME                   PIC X(10).
           05 TUSER                      PIC X(10).
           05 JOBNBR                     PIC X(6).
           05 JOBNAME                    PIC X(10).
           05 SPLNR                      PIC X(11).
           05 DRUCKER                    PIC X(10).
           05 FORMULAR                   PIC X(10).
           05 USRDTA                     PIC X(10).
           05 ASP                        PIC X(7).

     ‚* FELDER FÜR CLP0073 (CPYTOSTMF)
       01 CPYTOSTMF-TYPE IS TYPEDEF.
           05 FROMMBR                    PIC X(640).
           05 TOFILE                     PIC X(640).
           05 CPYMODE                    PIC X(8).
           05 CCSID                      PIC X(11).
           05 LINFMT                     PIC X(6).

     ‚* FELDER FÜR MAPDTA
       01  MAPDTA-TYPE IS TYPEDEF.
           05 MAP-ACT                    PIC X(1).
           05 MAP-FIL                    PIC X(15).
           05 MAP-PTR                    USAGE POINTER.
           05 MAP-KEY                    PIC X(100).
           05 MAP-REC                    PIC X(4000).
           05 MAP-RPT                    USAGE POINTER.
           05 MAP-LEN                    PIC S9(9) COMP-4.
           05 MAP-LFDN                   PIC S9(9) COMP-4.

       01  MAP-ACTION-REC.
           05 MAP-MAIN-ACTION            PIC X(20).
           05 MAP-WRITE                  PIC X(1) VALUE "1".
           05 MAP-READ                   PIC X(1) VALUE "2".
           05 MAP-DELETE                 PIC X(1) VALUE "3".
           05 MAP-CLEAR                  PIC X(1) VALUE "4".
           05 MAP-READ-NEXT              PIC X(1) VALUE "5".
           05 MAP-READ-PRIOR             PIC X(1) VALUE "6".
           05 MAP-READ-LFDN              PIC X(1) VALUE "7".
           05 MAP-CHGKEY                 PIC X(1) VALUE "8".
           05 MAP-CHGKEY-SORT            PIC X(1) VALUE "9".
           05 MAP-SORT                   PIC X(1) VALUE "S".
           05 MAP-GETCOUNT               PIC X(1) VALUE "C".
           05 MAP-GET-POINTER            PIC X(1) VALUE "P".

     ‚* FELDER FÜR DMP9000 (POINTERVERWALTUNG MITTELS ID)
       01  PTRMAP-TYPE IS TYPEDEF.
        05 PTR-ACTION                     PIC X(2).
     ‚*   FELDER FÜR DMP9000 (AKTIONSMÖGLICHKEITEN)
          88 PTR-READ                     VALUE "01".
          88 PTR-CREATE                   VALUE "02".
          88 PTR-DELETE                   VALUE "03".
          88 PTR-ADD                      VALUE "04".
          88 PTR-CLEAR                    VALUE "99".
          88 PTR-DEBUG                    VALUE "DB".
          88 PTR-PRINT                    VALUE "PR".
        05 PTR-KEY                        PIC X(100).
        05 PTR-MAIN                       USAGE POINTER.
        05 PTR-RETURN                     USAGE POINTER.
        05 PTR-INPUT                      USAGE POINTER.
        05 PTR-PARM                       USAGE POINTER.
        05 PTR-SPLF-NAME                  PIC X(10).
        05 PTR-SPLF-MODE                  PIC X(2).
        05 PTR-SPLF-USRDTA                PIC X(10).

       01  MAP-MAIN-ID                   PIC X(50).
       01  MAP-MAIN-PTR                  USAGE POINTER.

     ‚* FELDER FÜR HLP0006
       01  MAIL-LEN                  PIC 9(5).
       01  MAIL-TAB.
        02 MAIL-HOST                 PIC X(15).
        02 MAIL-PORT                 PIC X(5).
        02 MAIL-SENDER               PIC X(30).
     ‚*šINFO ZU DEN ÜBERGABEPARAMTERN:                     ‚*š
     ‚*šIN MAIL-ANZAHL STEHT DIE ANZAHL DER DATENSÄTZE FÜR DIE‚*š
     ‚*šJEWEILIGE TABELLE.                                 ‚*š
     ‚*š 02 RECORD                                          ‚*š
     ‚*š  05 MAIL-ANZAL                                       ‚*š
     ‚*š  05 MAIL-TABELLE                                     ‚*š
     ‚*š     10 MAIL-ADRESSE                                  ‚*š
     ‚* ÜBERNAHME DER EMPFÄNGER                             *
        02 MAIL-EMPF.
         05 MAIL-ANZAHL              PIC 9(2) BINARY.
         05 MAIL-EMPF-REC            OCCURS 10 TIMES.
          10 MAIL-ADRESSE            PIC X(64).
     ‚* ÜBERNAHME DER KOPIEADRESSEN
        02 MAIL-KOPIE.
         05 MAIL-ANZAHL              PIC 9(2) BINARY.
         05 MAIL-KOPIE-REC           OCCURS 10 TIMES.
          10 MAIL-ADRESSE            PIC X(64).
     ‚* ÜBERNAHME DER BLINDKOPIEADRESSEN
        02 MAIL-BKOPIE.
         05 MAIL-ANZAHL              PIC 9(2) BINARY.
         05 MAIL-BKOPIE-REC          OCCURS 10 TIMES.
          10 MAIL-ADRESSE            PIC X(64).
        02 MAIL-TOPIC                PIC X(96).
        02 MAIL-DATA                 PIC X(5120).
        02 MAIL-FILE                 PIC X(256).
     ‚* IM RETTXT STEHT DIE RÜCKMELDUNG DES SERVERS, FALLS
     ‚* DIESE NEGATIV WAR
        02 MAIL-RETTXT               PIC X(256).

     ‚* FELDER FÜR LGCHGPF  (CHGPF)
       01  CHGPF-REC.
           05  DATEI                     PIC  X(10).
           05  DATEILIB                  PIC  X(10).
           05  SRCFILE                   PIC  X(10).
           05  SRCLIB                    PIC  X(10).
           05  SIZEANFANG                PIC  X(10).
           05  SIZEERW                   PIC  X(5).
           05  SIZEMAXERW                PIC  X(5).
           05  REUSEDLT                  PIC  X(4).

     ‚* FELDER FÜR LGTFRGRP (TRFGRPJOB)
       01  TRFGRP-REC.
           05  GRPJOB                    PIC  X(10).
           05  INLGRPPGM                 PIC  X(10).
           05  TXT                       PIC  X(50).

     ‚* FELDER FÜR LGRTVGRPA (RTVGRPA)
       01  RTVGRPA-REC.
           05 GRPJOBN                    PIC  X(10).
           05 GRPJOBL                    PIC  X(1056).
           05 GRPCOUNT                   PIC  X(3).
           05 MSGQNAME                   PIC  X(10).
           05 MSGQLIB                    PIC  X(10).
           05 PRVJOB                     PIC  X(16).
           05 CTLCODE                    PIC  X(3).

     ‚* FELDER FÜR LGRMVMSGD (RMVMSGD)
       01  RMVMSGD-REC.
           05  MSGID                      PIC  X(7).
           05  MSGF                       PIC  X(10).
           05  MSGLIB                     PIC  X(10).

     ‚* FELDER FÜR LGRMVMSGD (RMVMSGD)
       01  RTVMSG-REC.
           05  MSGID                      PIC  X(7).
           05  MSGF                       PIC  X(10).
           05  MSGLIB                     PIC  X(10).
           05  MSGDTA                     PIC  X(80).
           05  MSG                        PIC  X(80).

     ‚* FELDER FÜR LGCHGMSG  (CHGMSGD)
       01  CHGMSG-REC.
           05  MSGID                      PIC  X(7).
           05  MSGF                       PIC  X(10).
           05  MSGLIB                     PIC  X(10).
           05  MSG                        PIC  X(80).

     ‚* FELDER FÜR LGRNMOBJ  (RNMOBJ)
       01  RNMOBJ-REC.
           05  OBJ                        PIC  X(10).
           05  LIB                        PIC  X(10).
           05  OBJTYPE                    PIC  X(7).
           05  NEWOBJ                     PIC  X(10).

     ‚* FELDER FÜR LGMOVOBJ  (MOVOBJ)
       01  MOVOBJ-REC.
           05  OBJ                        PIC  X(10).
           05  OBJLIB                     PIC  X(10).
           05  OBJTYP                     PIC  X(7).
           05  ZIELLIB                    PIC  X(10).

     ‚* FELDER FÜR LGSETATNP (SETATNPGM)
       01  SETATNPGM-REC.
           05  PGMNAME                    PIC  X(10).
           05  LIBNAME                    PIC  X(10).
           05  SWITCH                     PIC  X(4).


     ‚* FELDER FÜR LGCRTSBSD (CRTSBSD)
       01  CRTSBSD-REC.
           05  LFSSBS                     PIC  X(10).
           05  ASPLIB                     PIC  X(10).
           05  MAXJOBS                    PIC  X(4).
           05  POOLNR                     PIC  X(2).
           05  POOL                       PIC  X(10).
           05  SBSTEXT                    PIC  X(50).

     ‚* FELDER FÜR LGADDRTGE (ADDRTGE)
       01  ADDRTGE-REC.
           05  LFSSBS                     PIC  X(10).
           05  ASPLIB                     PIC  X(10).
           05  CLS                        PIC  X(10).
           05  CLSLIB                     PIC  X(10).

     ‚* FELDER FÜR LGCRTJOBQ (CRTJOBQ)
       01  CRTJOBQ-REC.
           05  LFSSBS                     PIC  X(10).
           05  ASPLIB                     PIC  X(10).
           05  QTEXT                      PIC  X(50).

     ‚* FELDER FÜR LGADDJQE  (ADDJOBQE)
       01  ADDJQE-REC.
           05  LFSSBS                     PIC  X(10).
           05  ASPLIB                     PIC  X(10).
           05  MAXACT                     PIC  X(10).

     ‚* FELDER FÜR LGCRTJOBD (CRTJOBD)
       01  CRTJOBD-REC.
           05  LFSJOBD                    PIC  X(10).
           05  ASPLIB                     PIC  X(10).
           05  LFSSBS                     PIC  X(10).
           05  JOBDTEXT                   PIC  X(50).

     ‚* FELDER FÜR LGCRTOUTQ (CRTOUTQ)
       01  CRTOUTQ-REC.
           05  LFSOUTQ                    PIC  X(10).
           05  ASPLIB                     PIC  X(10).
           05  OUTQTEXT                   PIC  X(50).



     ‚* FELDER FÜR LGSNDPGM (SNDPGMMSG)
       01 SNDPMSG-REC.
        05 MSG                            PIC X(150).
        05 MSGID                          PIC X(07).
        05 MSGF                           PIC X(10).
        05 TOPGMQ                         PIC X(10).
        05 TOMSGQ                         PIC X(10).
        05 MSGTYP                         PIC X(10).
        05 KEYVAR                         PIC X(10).
        05 MSGDTA                         PIC X(150).

     ‚* FELDER FÜR LGRCVMSG (RCVMSG)
       01 RCVMSG-REC.
        05 PGMQ                           PIC X(10).
        05 MSGQ                           PIC X(10).
        05 MSGTYPE                        PIC X(10).
        05 MSG                            PIC X(150).
        05 SECLVL                         PIC X(150).
        05 RMV                            PIC X(10).
        05 MSGID                          PIC X(7).

     ‚* FELDER FÜR LGCHGJOB (CHGJOB)
       01 CHGJOB-REC.
        05 JOBNAM                         PIC X(10).
        05 JOBUSER                        PIC X(10).
        05 JOBNUM                         PIC X(06).
        05 DECFORMAT                      PIC X(07).
        05 RUNPTY                         PIC X(02).
        05 LANGID                         PIC X(03).
        05 CCSID                          PIC X(10).

     ‚* FELDER FÜR LGCPYFIPF (CPYFRMIMPF)
       01 CPYFIPF-REC.
        05 FROMSTMF                       PIC X(50).
        05 FROMFILE                       PIC X(10).
        05 FROMLIB                        PIC X(10).
        05 FROMMBR                        PIC X(10).
        05 TOFILE                         PIC X(10).
        05 TOLIB                          PIC X(10).
        05 TOMBR                          PIC X(10).
        05 MBROPT                         PIC X(10).
        05 RCDDLM                         PIC X(10).
        05 STRDLM                         PIC X(05).
        05 RMVBLANK                       PIC X(09).
        05 FLDDLM                         PIC X(04).
        05 FROMRCD                        PIC X(10).
        05 ERRLVL                         PIC X(10).
        05 DTAFMT                         PIC X(10).
        05 RPLNULLVAL                     PIC X(07).

     ‚* FELDER FÜR LGCRTDIR (CRTDIR)
       01 CRTDIR-REC.
        05 DIRNAM                         PIC X(512).
        05 DTAAUT                         PIC X(10).
        05 OBJAUT                         PIC X(10).

     ‚* FELDER FÜR LGCHGAUT (CHGAUT)
       01 CHGAUT-REC.
        05 OBJEKT                         PIC X(90).
        05 USER                           PIC X(10).
        05 DTAAUT                         PIC X(10).
        05 OBJAUT                         PIC X(10).

     ‚* FELDER FÜR LGCRTCLS (CRTCLS)
       01  CRTCLS-REC.
           05  LFSCLS                     PIC  X(10).
           05  ASPLIB                     PIC  X(10).
           05  RUNPTY                     PIC  X(2) VALUE "50".
           05  TIMESLICE                  PIC  X(7) VALUE "0002000".
           05  CLSPURGE                   PIC  X(4) VALUE "*YES".
           05  DFTWAIT                    PIC  X(7) VALUE "0000030".
           05  CPUTIME                    PIC  X(7) VALUE "*NOMAX ".
           05  MAXTMPSTG                  PIC  X(10) VALUE "*NOMAX   ".
           05  MAXTHD                     PIC  X(6) VALUE "*NOMAX".
           05  CLSTEXT                    PIC  X(50) VALUE "*BLANK".


     ‚* FELDER FÜR LGCPYTIPF (CPYTOIMPF)
       01 CPYTIPF-REC.
        05 FROMFILE                       PIC X(10).
        05 FROMLIB                        PIC X(10).
        05 FROMMBR                        PIC X(10).
        05 TOFILE                         PIC X(10).
        05 TOLIB                          PIC X(10).
        05 TOMBR                          PIC X(10).
        05 TOSTMF                         PIC X(256).
        05 MBROPT                         PIC X(10).
        05 STMFCODP                       PIC X(10).
        05 RCDDLM                         PIC X(10).
        05 STRDLM                         PIC X(05).
        05 FLDDLM                         PIC X(03).

     ‚* FELDER FÜR LGCHGOBJD (CHGOBJD)
       01 CHGOBJD-REC.
        05 LIBNAME                        PIC X(10).
        05 OBJNAME                        PIC X(10).
        05 OBJTYPE                        PIC X(10).
        05 OBJTEXT                        PIC X(50).

     ‚* FELDER FÜR RTVSYSVAL
       01  RTVSYSVAL-REC.
           05 SYSVAL                      PIC X(10).
           05 RTNVAR                      PIC X(500).

     ‚* FELDER FÜR DSPJOBLOG
       01  DSPJOBLOG-REC.
           05 JOBN                        PIC X(10).
           05 USER                        PIC X(10).
           05 JBNR                        PIC 9(06).
           05 OUTP                        PIC X(10).
           05 OUTFILE                     PIC X(10).
           05 OUTLIB                      PIC X(10).
           05 OUTOPT                      PIC X(10).

